test/multiphase/reactingTwoPhaseEulerFoam/interfaceComposition/waterEvaporation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 -1 -1)
    (1 -1 -1)
    (1 1 -1)
    (-1 1 -1)

    (-1 -1 1)
    (1 -1 1)
    (1 1 1)
    (-1 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    name defaultPatch;
    type empty;
}

patches
(
);

mergePatchPairs
(
);

// ************************************************************************* //
